using System.ComponentModel;
using System.Diagnostics;
using System.Numerics;
using System.Security.Cryptography;
using FastGoat.Commons;
using FastGoat.Examples;
using FastGoat.Structures;
using FastGoat.Structures.CartesianProduct;
using FastGoat.Structures.GenericGroup;
using FastGoat.Structures.VecSpace;
using FastGoat.UserGroup;
using FastGoat.UserGroup.Characters;
using FastGoat.UserGroup.Integers;
using FastGoat.UserGroup.Matrix;
using FastGoat.UserGroup.Perms;
using FastGoat.UserGroup.Polynoms;
using FastGoat.UserGroup.Words;
using FastGoat.UserGroup.Words.ToddCoxeter;
using static FastGoat.Commons.IntExt;
using static FastGoat.Commons.EnumerableExt;
using FastGoat.UserGroup.Padic;

//////////////////////////////////
//                              //
//    Work Table for crafting   //
//                              //
//////////////////////////////////

Console.WriteLine("Hello World");

{
    FG.CharacterTable(FG.DihedralSdp(15)).DisplayCells();
}
/*
   |D30| = 30
   Type        NonAbelianGroup
   BaseGroup   C15 x C2
   
   [Class      1   2   3             5a             5b            15a            15b            15c            15d]
   [ Size      1  15   2              2              2              2              2              2              2]
   [                                                                                                              ]
   [  Ꭓ.1      1   1   1              1              1              1              1              1              1]
   [  Ꭓ.2      1  -1   1              1              1              1              1              1              1]
   [  Ꭓ.3      2   0  -1              2              2             -1             -1             -1             -1]
   [  Ꭓ.4      2   0  -1  -1/2 + 1/2·√5  -1/2 - 1/2·√5   ξ15⁴ + ξ15¹¹    ξ15⁷ + ξ15⁸    ξ15 + ξ15¹⁴   ξ15² + ξ15¹³]
   [  Ꭓ.5      2   0  -1  -1/2 + 1/2·√5  -1/2 - 1/2·√5    ξ15 + ξ15¹⁴   ξ15² + ξ15¹³   ξ15⁴ + ξ15¹¹    ξ15⁷ + ξ15⁸]
   [  Ꭓ.6      2   0  -1  -1/2 - 1/2·√5  -1/2 + 1/2·√5   ξ15² + ξ15¹³   ξ15⁴ + ξ15¹¹    ξ15⁷ + ξ15⁸    ξ15 + ξ15¹⁴]
   [  Ꭓ.7      2   0  -1  -1/2 - 1/2·√5  -1/2 + 1/2·√5    ξ15⁷ + ξ15⁸    ξ15 + ξ15¹⁴   ξ15² + ξ15¹³   ξ15⁴ + ξ15¹¹]
   [  Ꭓ.8      2   0   2  -1/2 + 1/2·√5  -1/2 - 1/2·√5  -1/2 - 1/2·√5  -1/2 + 1/2·√5  -1/2 - 1/2·√5  -1/2 + 1/2·√5]
   [  Ꭓ.9      2   0   2  -1/2 - 1/2·√5  -1/2 + 1/2·√5  -1/2 + 1/2·√5  -1/2 - 1/2·√5  -1/2 + 1/2·√5  -1/2 - 1/2·√5]
   All i,                 Sum[g](Xi(g)Xi(g^−1)) = |G|      : True
   All i <> j,            Sum[g](Xi(g)Xj(g^−1)) =  0       : True
   All g, h in Cl(g),     Sum[r](Xr(g)Xr(h^−1)) = |Cl(g)|  : True
   All g, h not in Cl(g), Sum[r](Xr(g)Xr(h^−1)) =  0       : True
*/

{
    FG.CharacterTable(Group.SemiDirectProd(new Cn(13), new Cn(4))).DisplayCells();
}

/*
   |C13 x: C4| = 52
   Type        NonAbelianGroup
   BaseGroup   C13 x C4
   
   [Class      1   2  4a  4b                          13a                          13b                          13c]
   [ Size      1  13  13  13                            4                            4                            4]
   [                                                                                                               ]
   [  Ꭓ.1      1   1   1   1                            1                            1                            1]
   [  Ꭓ.2      1   1  -1  -1                            1                            1                            1]
   [  Ꭓ.3      1  -1  -I   I                            1                            1                            1]
   [  Ꭓ.4      1  -1   I  -I                            1                            1                            1]
   [  Ꭓ.5      4   0   0   0    ξ13 + ξ13⁵ + ξ13⁸ + ξ13¹²  ξ13² + ξ13³ + ξ13¹⁰ + ξ13¹¹    ξ13⁴ + ξ13⁶ + ξ13⁷ + ξ13⁹]
   [  Ꭓ.6      4   0   0   0  ξ13² + ξ13³ + ξ13¹⁰ + ξ13¹¹    ξ13⁴ + ξ13⁶ + ξ13⁷ + ξ13⁹    ξ13 + ξ13⁵ + ξ13⁸ + ξ13¹²]
   [  Ꭓ.7      4   0   0   0    ξ13⁴ + ξ13⁶ + ξ13⁷ + ξ13⁹    ξ13 + ξ13⁵ + ξ13⁸ + ξ13¹²  ξ13² + ξ13³ + ξ13¹⁰ + ξ13¹¹]
   All i,                 Sum[g](Xi(g)Xi(g^−1)) = |G|      : True
   All i <> j,            Sum[g](Xi(g)Xj(g^−1)) =  0       : True
   All g, h in Cl(g),     Sum[r](Xr(g)Xr(h^−1)) = |Cl(g)|  : True
   All g, h not in Cl(g), Sum[r](Xr(g)Xr(h^−1)) =  0       : True   
*/

{
    GlobalStopWatch.Restart();
    FG.CharacterTable(Group.AutomorphismGroup(FG.Abelian(2, 2, 2))).DisplayCells();
    GlobalStopWatch.Show("GL(3,2)");
}
/*
   |Aut[C2 x C2 x C2]| = 168
   Type        NonAbelianGroup
   BaseGroup   Aut(C2 x C2 x C2)
   
   [Class      1   2   3   4              7a              7b]
   [ Size      1  21  56  42              24              24]
   [                                                        ]
   [  Ꭓ.1      1   1   1   1               1               1]
   [  Ꭓ.2      3  -1   0   1  -1/2 - 1/2·I√7  -1/2 + 1/2·I√7]
   [  Ꭓ.3      3  -1   0   1  -1/2 + 1/2·I√7  -1/2 - 1/2·I√7]
   [  Ꭓ.4      6   2   0   0              -1              -1]
   [  Ꭓ.5      7  -1   1  -1               0               0]
   [  Ꭓ.6      8   0  -1   0               1               1]
   All i,                 Sum[g](Xi(g)Xi(g^−1)) = |G|      : True
   All i <> j,            Sum[g](Xi(g)Xj(g^−1)) =  0       : True
   All g, h in Cl(g),     Sum[r](Xr(g)Xr(h^−1)) = |Cl(g)|  : True
   All g, h not in Cl(g), Sum[r](Xr(g)Xr(h^−1)) =  0       : True
   
   # GL(3,2) Time:43917 ms   
*/

{
    GlobalStopWatch.Restart();
    FG.CharacterTable(FG.FrobeniusSdp(105)[0]).DisplayCells();
    GlobalStopWatch.Show("Frob(7,15,2)"); // # Frob(7,15,2) Time:164046 ms
}

/*
   |Frob(7,15,2)| = 105
   Type        NonAbelianGroup
   BaseGroup   C7 x C15
   
   [Class      1   3a   3b     5a     5b     5c     5d              7a              7b    15a    15b    15c    15d    15e    15f    15g    15h                    35a                    35b                    35c                    35d                    35e                    35f                    35g                    35h]
   [ Size      1    7    7      1      1      1      1               3               3      7      7      7      7      7      7      7      7                      3                      3                      3                      3                      3                      3                      3                      3]
   [                                                                                                                                                                                                                                                                                                                                  ]
   [  Ꭓ.1      1    1    1      1      1      1      1               1               1      1      1      1      1      1      1      1      1                      1                      1                      1                      1                      1                      1                      1                      1]
   [  Ꭓ.2      1   ξ3  ξ3²      1      1      1      1               1               1    ξ3²     ξ3    ξ3²    ξ3²     ξ3     ξ3    ξ3²     ξ3                      1                      1                      1                      1                      1                      1                      1                      1]
   [  Ꭓ.3      1  ξ3²   ξ3      1      1      1      1               1               1     ξ3    ξ3²     ξ3     ξ3    ξ3²    ξ3²     ξ3    ξ3²                      1                      1                      1                      1                      1                      1                      1                      1]
   [  Ꭓ.4      1    1    1     ξ5    ξ5²    ξ5³    ξ5⁴               1               1    ξ5²    ξ5⁴    ξ5³    ξ5⁴     ξ5    ξ5²     ξ5    ξ5³                     ξ5                    ξ5²                    ξ5³                    ξ5⁴                     ξ5                    ξ5²                    ξ5³                    ξ5⁴]
   [  Ꭓ.5      1    1    1    ξ5²    ξ5⁴     ξ5    ξ5³               1               1    ξ5⁴    ξ5³     ξ5    ξ5³    ξ5²    ξ5⁴    ξ5²     ξ5                    ξ5²                    ξ5⁴                     ξ5                    ξ5³                    ξ5²                    ξ5⁴                     ξ5                    ξ5³]
   [  Ꭓ.6      1    1    1    ξ5³     ξ5    ξ5⁴    ξ5²               1               1     ξ5    ξ5²    ξ5⁴    ξ5²    ξ5³     ξ5    ξ5³    ξ5⁴                    ξ5³                     ξ5                    ξ5⁴                    ξ5²                    ξ5³                     ξ5                    ξ5⁴                    ξ5²]
   [  Ꭓ.7      1    1    1    ξ5⁴    ξ5³    ξ5²     ξ5               1               1    ξ5³     ξ5    ξ5²     ξ5    ξ5⁴    ξ5³    ξ5⁴    ξ5²                    ξ5⁴                    ξ5³                    ξ5²                     ξ5                    ξ5⁴                    ξ5³                    ξ5²                     ξ5]
   [  Ꭓ.8      1   ξ3  ξ3²     ξ5    ξ5²    ξ5³    ξ5⁴               1               1    ξ15   ξ15²   ξ15⁴   ξ15⁷   ξ15⁸  ξ15¹¹  ξ15¹³  ξ15¹⁴                     ξ5                    ξ5²                    ξ5³                    ξ5⁴                     ξ5                    ξ5²                    ξ5³                    ξ5⁴]
   [  Ꭓ.9      1   ξ3  ξ3²    ξ5²    ξ5⁴     ξ5    ξ5³               1               1   ξ15⁷  ξ15¹⁴  ξ15¹³   ξ15⁴  ξ15¹¹   ξ15²    ξ15   ξ15⁸                    ξ5²                    ξ5⁴                     ξ5                    ξ5³                    ξ5²                    ξ5⁴                     ξ5                    ξ5³]
   [ Ꭓ.10      1   ξ3  ξ3²    ξ5³     ξ5    ξ5⁴    ξ5²               1               1  ξ15¹³  ξ15¹¹   ξ15⁷    ξ15  ξ15¹⁴   ξ15⁸   ξ15⁴   ξ15²                    ξ5³                     ξ5                    ξ5⁴                    ξ5²                    ξ5³                     ξ5                    ξ5⁴                    ξ5²]
   [ Ꭓ.11      1   ξ3  ξ3²    ξ5⁴    ξ5³    ξ5²     ξ5               1               1   ξ15⁴   ξ15⁸    ξ15  ξ15¹³   ξ15²  ξ15¹⁴   ξ15⁷  ξ15¹¹                    ξ5⁴                    ξ5³                    ξ5²                     ξ5                    ξ5⁴                    ξ5³                    ξ5²                     ξ5]
   [ Ꭓ.12      1  ξ3²   ξ3     ξ5    ξ5²    ξ5³    ξ5⁴               1               1  ξ15¹¹   ξ15⁷  ξ15¹⁴   ξ15²  ξ15¹³    ξ15   ξ15⁸   ξ15⁴                     ξ5                    ξ5²                    ξ5³                    ξ5⁴                     ξ5                    ξ5²                    ξ5³                    ξ5⁴]
   [ Ꭓ.13      1  ξ3²   ξ3    ξ5²    ξ5⁴     ξ5    ξ5³               1               1   ξ15²   ξ15⁴   ξ15⁸  ξ15¹⁴    ξ15   ξ15⁷  ξ15¹¹  ξ15¹³                    ξ5²                    ξ5⁴                     ξ5                    ξ5³                    ξ5²                    ξ5⁴                     ξ5                    ξ5³]
   [ Ꭓ.14      1  ξ3²   ξ3    ξ5³     ξ5    ξ5⁴    ξ5²               1               1   ξ15⁸    ξ15   ξ15²  ξ15¹¹   ξ15⁴  ξ15¹³  ξ15¹⁴   ξ15⁷                    ξ5³                     ξ5                    ξ5⁴                    ξ5²                    ξ5³                     ξ5                    ξ5⁴                    ξ5²]
   [ Ꭓ.15      1  ξ3²   ξ3    ξ5⁴    ξ5³    ξ5²     ξ5               1               1  ξ15¹⁴  ξ15¹³  ξ15¹¹   ξ15⁸   ξ15⁷   ξ15⁴   ξ15²    ξ15                    ξ5⁴                    ξ5³                    ξ5²                     ξ5                    ξ5⁴                    ξ5³                    ξ5²                     ξ5]
   [ Ꭓ.16      3    0    0      3      3      3      3  -1/2 - 1/2·I√7  -1/2 + 1/2·I√7      0      0      0      0      0      0      0      0         -1/2 - 1/2·I√7         -1/2 - 1/2·I√7         -1/2 - 1/2·I√7         -1/2 - 1/2·I√7         -1/2 + 1/2·I√7         -1/2 + 1/2·I√7         -1/2 + 1/2·I√7         -1/2 + 1/2·I√7]
   [ Ꭓ.17      3    0    0      3      3      3      3  -1/2 + 1/2·I√7  -1/2 - 1/2·I√7      0      0      0      0      0      0      0      0         -1/2 + 1/2·I√7         -1/2 + 1/2·I√7         -1/2 + 1/2·I√7         -1/2 + 1/2·I√7         -1/2 - 1/2·I√7         -1/2 - 1/2·I√7         -1/2 - 1/2·I√7         -1/2 - 1/2·I√7]
   [ Ꭓ.18      3    0    0  3·ξ5³   3·ξ5  3·ξ5⁴  3·ξ5²  -1/2 - 1/2·I√7  -1/2 + 1/2·I√7      0      0      0      0      0      0      0      0    ξ35 + ξ35¹¹ + ξ35¹⁶   ξ35² + ξ35²² + ξ35³²   ξ35⁸ + ξ35¹⁸ + ξ35²³    ξ35⁴ + ξ35⁹ + ξ35²⁹   ξ35⁶ + ξ35²⁶ + ξ35³¹  ξ35¹² + ξ35¹⁷ + ξ35²⁷   ξ35³ + ξ35¹³ + ξ35³³  ξ35¹⁹ + ξ35²⁴ + ξ35³⁴]
   [ Ꭓ.19      3    0    0  3·ξ5³   3·ξ5  3·ξ5⁴  3·ξ5²  -1/2 + 1/2·I√7  -1/2 - 1/2·I√7      0      0      0      0      0      0      0      0   ξ35⁶ + ξ35²⁶ + ξ35³¹  ξ35¹² + ξ35¹⁷ + ξ35²⁷   ξ35³ + ξ35¹³ + ξ35³³  ξ35¹⁹ + ξ35²⁴ + ξ35³⁴    ξ35 + ξ35¹¹ + ξ35¹⁶   ξ35² + ξ35²² + ξ35³²   ξ35⁸ + ξ35¹⁸ + ξ35²³    ξ35⁴ + ξ35⁹ + ξ35²⁹]
   [ Ꭓ.20      3    0    0   3·ξ5  3·ξ5²  3·ξ5³  3·ξ5⁴  -1/2 - 1/2·I√7  -1/2 + 1/2·I√7      0      0      0      0      0      0      0      0   ξ35² + ξ35²² + ξ35³²    ξ35⁴ + ξ35⁹ + ξ35²⁹    ξ35 + ξ35¹¹ + ξ35¹⁶   ξ35⁸ + ξ35¹⁸ + ξ35²³  ξ35¹² + ξ35¹⁷ + ξ35²⁷  ξ35¹⁹ + ξ35²⁴ + ξ35³⁴   ξ35⁶ + ξ35²⁶ + ξ35³¹   ξ35³ + ξ35¹³ + ξ35³³]
   [ Ꭓ.21      3    0    0   3·ξ5  3·ξ5²  3·ξ5³  3·ξ5⁴  -1/2 + 1/2·I√7  -1/2 - 1/2·I√7      0      0      0      0      0      0      0      0  ξ35¹² + ξ35¹⁷ + ξ35²⁷  ξ35¹⁹ + ξ35²⁴ + ξ35³⁴   ξ35⁶ + ξ35²⁶ + ξ35³¹   ξ35³ + ξ35¹³ + ξ35³³   ξ35² + ξ35²² + ξ35³²    ξ35⁴ + ξ35⁹ + ξ35²⁹    ξ35 + ξ35¹¹ + ξ35¹⁶   ξ35⁸ + ξ35¹⁸ + ξ35²³]
   [ Ꭓ.22      3    0    0  3·ξ5⁴  3·ξ5³  3·ξ5²   3·ξ5  -1/2 - 1/2·I√7  -1/2 + 1/2·I√7      0      0      0      0      0      0      0      0   ξ35⁸ + ξ35¹⁸ + ξ35²³    ξ35 + ξ35¹¹ + ξ35¹⁶    ξ35⁴ + ξ35⁹ + ξ35²⁹   ξ35² + ξ35²² + ξ35³²   ξ35³ + ξ35¹³ + ξ35³³   ξ35⁶ + ξ35²⁶ + ξ35³¹  ξ35¹⁹ + ξ35²⁴ + ξ35³⁴  ξ35¹² + ξ35¹⁷ + ξ35²⁷]
   [ Ꭓ.23      3    0    0  3·ξ5⁴  3·ξ5³  3·ξ5²   3·ξ5  -1/2 + 1/2·I√7  -1/2 - 1/2·I√7      0      0      0      0      0      0      0      0   ξ35³ + ξ35¹³ + ξ35³³   ξ35⁶ + ξ35²⁶ + ξ35³¹  ξ35¹⁹ + ξ35²⁴ + ξ35³⁴  ξ35¹² + ξ35¹⁷ + ξ35²⁷   ξ35⁸ + ξ35¹⁸ + ξ35²³    ξ35 + ξ35¹¹ + ξ35¹⁶    ξ35⁴ + ξ35⁹ + ξ35²⁹   ξ35² + ξ35²² + ξ35³²]
   [ Ꭓ.24      3    0    0  3·ξ5²  3·ξ5⁴   3·ξ5  3·ξ5³  -1/2 - 1/2·I√7  -1/2 + 1/2·I√7      0      0      0      0      0      0      0      0    ξ35⁴ + ξ35⁹ + ξ35²⁹   ξ35⁸ + ξ35¹⁸ + ξ35²³   ξ35² + ξ35²² + ξ35³²    ξ35 + ξ35¹¹ + ξ35¹⁶  ξ35¹⁹ + ξ35²⁴ + ξ35³⁴   ξ35³ + ξ35¹³ + ξ35³³  ξ35¹² + ξ35¹⁷ + ξ35²⁷   ξ35⁶ + ξ35²⁶ + ξ35³¹]
   [ Ꭓ.25      3    0    0  3·ξ5²  3·ξ5⁴   3·ξ5  3·ξ5³  -1/2 + 1/2·I√7  -1/2 - 1/2·I√7      0      0      0      0      0      0      0      0  ξ35¹⁹ + ξ35²⁴ + ξ35³⁴   ξ35³ + ξ35¹³ + ξ35³³  ξ35¹² + ξ35¹⁷ + ξ35²⁷   ξ35⁶ + ξ35²⁶ + ξ35³¹    ξ35⁴ + ξ35⁹ + ξ35²⁹   ξ35⁸ + ξ35¹⁸ + ξ35²³   ξ35² + ξ35²² + ξ35³²    ξ35 + ξ35¹¹ + ξ35¹⁶]
   All i,                 Sum[g](Xi(g)Xi(g^−1)) = |G|      : True
   All i <> j,            Sum[g](Xi(g)Xj(g^−1)) =  0       : True
   All g, h in Cl(g),     Sum[r](Xr(g)Xr(h^−1)) = |Cl(g)|  : True
   All g, h not in Cl(g), Sum[r](Xr(g)Xr(h^−1)) =  0       : True
   
   # Frob(7,15,2) Time:171532 ms   
 */
